# Задача 1
# В модуль с проверкой даты добавьте возможность запуска в терминале с передачей даты на проверку.


from data.task1 import *

if __name__ == "__main__":
    print(date_validate('01.07.2023'))
